product_types = ProductType.all
product_types.each do |product_type|
  if product_type.id == 1
    product_type.description = "Состав: хлопок 100%. Яркие цвета. Изделия не деформируются после многочисленных стирок. Воротник с добавлением лайкры. Мягкий компенсатор горловины. Усиленные плечевые швы. Везде двойная строчка. Суперстойкое активное крашение цветных и дополнительное отбеливание белых изделий. Для производства футболок используется суперчесанный хлопок высшего качества. Плотная вязка - идеально подходят для нанесения сложных цветных изображений. <b><br>Плотность: 155 гр/м2<br>Размеры: S-3XL<br>Количество цветов: 24<br></b>" + "<a href=\"http://www.modernimport.by/futbolki\" class=\"underline_link\">Мужские футболки в Минске</a> от МодернИмпорт.<br>"
    product_type.save
  else
    if product_type.id == 2
      product_type.description = "<b><br>Плотность: 155 гр/м2<br>Размеры: S-2XL<br>Количество цветов: 9<br></b>" + "<a href=\"http://www.modernimport.by/futbolki\" class=\"underline_link\">Женские футболки в Минске</a> от МодернИмпорт.<br>"
      product_type.save
    else
      if product_type.id == 3
      	product_type.description = "Состав: хлопок 100%. Яркие цвета. Изделия не деформируются после многочисленных стирок. Воротник с добавлением лайкры. Мягкий компенсатор горловины. Усиленные плечевые швы. Везде двойная строчка. Суперстойкое активное крашение цветных и дополнительное отбеливание белых изделий. Для производства футболок используется суперчесанный хлопок высшего качества. Плотная вязка - идеально подходят для нанесения сложных цветных изображений.<b><br>Плотность: 155 гр/м2<br>Размеры: 5XS-S<br>Количество цветов: 14<br></b>" + "<a href=\"http://www.modernimport.by/futbolki\" class=\"underline_link\">Детские футболки в Минске</a> от МодернИмпорт.<br>"
      	product_type.save
  	  else
  	  	if product_type.id == 4
  	  	  product_type.description = "Состав: хлопок 100%. Яркие цвета. Изделия не деформируются после многочисленных стирок. Воротник с добавлением лайкры. Мягкий компенсатор горловины. Усиленные плечевые швы. Везде двойная строчка. Суперстойкое активное крашение цветных и дополнительное отбеливание белых изделий. Для производства футболок используется суперчесанный хлопок высшего качества. Плотная вязка - идеально подходят для нанесения сложных цветных изображений. <b><br>Плотность: 155 гр/м2<br>Размеры: S-3XL<br>Количество цветов: 7<br></b>" + "<a href=\"http://www.modernimport.by/futbolki\" class=\"underline_link\">Футболки оптом в Минске</a> от МодернИмпорт.<br>"
  	  	  product_type.save
  	  	else
  	  	  if product_type.id == 5
  	  	  	product_type.description = "Состав: хлопок 92%+лайкра 8%. Для производства мужских футболок используется суперчесанный хлопок высшего качества. Подчеркивают фигуру. Суперстойкое активное крашение цветных и дополнительное отбеливание белых изделий. Идеально подходят для нанесения сложных цветных изображений.<b><br>Плотность: 180 гр/м2<br>Размеры: M-2XL<br>Количество цветов: 7<br></b>" + "<a href=\"http://www.modernimport.by/futbolki\" class=\"underline_link\">Футболки в Минске</a> от МодернИмпорт.<br>"
  	  	  	product_type.save
  	  	  else
  	  	  	if product_type.id == 6
  	  	  	  product_type.description = "Состав: хлопок 92%+лайкра 8%. Для производства женских футболок используется суперчесанный хлопок высшего качества. Зауженные двойные строчки и модельный ворот придают элегантность и подчеркивают женственность. Суперстойкое активное крашение цветных и дополнительное отбеливание белых изделий. Футболки идеально подходят для нанесения сложных цветных изображений.<b><br>Плотность: 200 гр/м2<br>Размеры: XS-XL<br>Количество цветов: 19<br></b>" + "<a href=\"http://www.modernimport.by/futbolki\" class=\"underline_link\">Купить футболку</a> из хлопка в Минске.<br>" 
  	  	  	  product_type.save
  	  	    else
  	  	      if product_type.id == 7
  	  	      	product_type.description = "Состав: хлопок 92%+лайкра 8%. Для производства мужских футболок используется суперчесанный хлопок высшего качества. Подчеркивают фигуру. Суперстойкое активное крашение цветных и дополнительное отбеливание белых изделий. Идеально подходят для нанесения сложных цветных изображений.<b><br>Плотность: 180 гр/м2<br>Размеры: M-2XL<br>Количество цветов: 7<br></b>" + "<a href=\"http://www.modernimport.by/futbolki\" class=\"underline_link\">Качественные футболки< в Минске.<br>"
  	  	      	product_type.save
  	  	      else
  	  	      	if product_type.id == 8
  	  	      	  product_type.description = "Состав: хлопок 92%+лайкра 8%. Для производства женских футболок используется суперчесанный хлопок высшего качества. Зауженные двойные строчки и модельный ворот придают элегантность и подчеркивают женственность. Суперстойкое активное крашение цветных и дополнительное отбеливание белых изделий. Футболки идеально подходят для нанесения сложных цветных изображений.<b><br>Плотность: 180 гр/м2<br>Размеры: S-XL<br>Количество цветов: 8<br></b>" + "<a href=\"http://www.modernimport.by/futbolki\" class=\"underline_link\">Мужские, женские и детские футболки оптом в Минске</a>.<br>"
  	  	      	  product_type.save
  	  	        else
  	  	          if product_type.id == 9
  	  	      	    product_type.description = "Состав: хлопок 100%. Яркие цвета. Воротник с добавлением лайкры. Мягкий компенсатор горловины. Усиленные плечевые швы. Везде двойная строчка. Суперстойкое активное крашение цветных и дополнительное отбеливание белых изделий. Для производства футболок используется суперчесанный хлопок высшего качества.<b><br>Плотность: 125 гр/м2<br>Размеры: S-3XL<br>Количество цветов: 15<br></b>" + "<a href=\"http://www.modernimport.by/futbolki\" class=\"underline_link\">Мужские, женские и детские футболки оптом в Минске</a>.<br>"
  	  	      	    product_type.save
  	  	      	  else
  	  	      	  	if product_type.id == 10
  	  	      	  	  product_type.description = "Состав: хлопок 100%. Яркие цвета. Воротник с добавлением лайкры. Мягкий компенсатор горловины. Усиленные плечевые швы. Везде двойная строчка. Суперстойкое активное крашение цветных и дополнительное отбеливание белых изделий. Для производства футболок используется суперчесанный хлопок высшего качества.<b><br>Плотность: 125 гр/м2<br>Размеры: S-3XL<br>Количество цветов: 12<br></b>" + "<a href=\"http://www.modernimport.by/futbolki\" class=\"underline_link\">Мужские, женские и детские футболки оптом в Минске</a>.<br>"
  	  	      	      product_type.save
  	  	      	    else
  	  	      	      if product_type.id == 11
  	  	      	      	product_type.description = "Материал: пике, хлопок 100%. Усиленные плечевые швы. Декоративная отделка планки пуговицами в тон ткани. Суперстойкое активное крашение цветных и дополнительное отбеливание белых изделий. Плотная вязка полотна, качественный пошив. Для производства используется суперчесанный хлопок высшего качества.<b><br>Плотность: 180 гр/м2<br>Размеры: XS-2XL<br>Количество цветов: 14<br></b>" + "Покупайте <a href=\"http://www.modernimport.by/rubashki-polo\" class=\"underline_link\">рубашки поло в Минске</a> у Модерн Импорт!<br>"
  	  	      	      	product_type.save
  	  	      	      else
  	  	      	      	if product_type.id == 12
  	  	      	      	  product_type.description = "Материал: пике, хлопок 92% + лайкра 8%. Приталенный силуэт.Усиленные плечевые швы. Декоративная отделка планки пуговицами в тон ткани. Суперстойкое активное крашение цветных и дополнительное отбеливание белых изделий. Плотная вязка полотна, качественный пошив. Для производства используется суперчесанный хлопок высшего качества.<b><br>Плотность: 220 гр/м2<br>Размеры: S-4XL<br>Количество цветов: 12<br></b>" + "Покупайте <a href=\"http://www.modernimport.by/rubashki-polo\" class=\"underline_link\">рубашки поло в Минске</a> у Модерн Импорт!<br>"
  	  	      	      	  product_type.save
  	  	      	        else
  	  	      	          if product_type.id == 13
  	  	      	          	product_type.description = "Материал: футер, хлопок 100%. Элегантная современная модель с карманами и декоративными манжетами снизу и на рукавах. Использование суперчесанного хлопка высшего качества и новейших технологий обработки ткани обеспечивают мягкость и шелковистость изделия. Не оставляют ворса на одежде. Вся фурнитура окрашена в цвет изделия. Суперстойкое активное крашение цветных и дополнительное отбеливание белых изделий.<b><br>Плотность: 260 гр/м2<br>Размеры: S-2XL<br>Количество цветов: 6<br></b>" + "<a href=\"http://www.modernimport.by/tolstovki\" class=\"underline_link\">Покупайте мужские толстовки в Минске у Модерн Импорт!<br>"
  	  	      	          	product_type.save
  	  	      	          else
  	  	      	            if product_type.id == 14
  	  	      	          	  product_type.description = "Материал: футер, хлопок 100%. Элегантная современная модель с карманами и декоративными манжетами снизу и на рукавах. Использование суперчесанного хлопка высшего качества и новейших технологий обработки ткани обеспечивают мягкость и шелковистость изделия. Не оставляют ворса на одежде. Вся фурнитура окрашена в цвет изделия. Суперстойкое активное крашение цветных и дополнительное отбеливание белых изделий. <b><br>Плотность: 260 гр/м2<br>Размеры: XS-XL<br>Количество цветов: 8<br></b>" + "<a href=\"http://www.modernimport.by/tolstovki\" class=\"underline_link\">Покупайте мужские толстовки в Минске у Модерн Импорт!<br>"
  	  	      	          	  product_type.save
  	  	      	            else
  	  	      	              if product_type.id == 15
  	  	      	              	product_type.description = "Состав: хлопок 100%. Пятиклинка. Яркие цвета. Металлическая застежка. Плотный козырек с пластиковой вставкой.<b><br>Плотность: 100 гр/м2<br>Количество цветов: 20<br></b>" + "Покупайте <a href=\"http://www.modernimport.by/beysbolki\" class=\"underline_link\">бейсболки</a> в Минске у Модерн Импорт!<br>"
  	  	      	              	product_type.save
  	  	      	              else
  	  	      	                if product_type.id == 16
  	  	      	                  product_type.description = "Состав: хлопок 100%. Пятиклинка. Велюровая джинса. Яркие цвета. Металлическая застежка. Плотный козырек с пластиковой вставкой.<b><br>Плотность: 200 гр/м2<br>Количество цветов: 14<br></b>" + "Покупайте <a href=\"http://www.modernimport.by/beysbolki\" class=\"underline_link\">бейсболки</a> в Минске у Модерн Импорт!<br>"
  	  	      	              	  product_type.save
  	  	      	                else
  	  	      	                  if product_type.id == 17
  	  	      	              	    product_type.description = "Состав: хлопок 100%. Пятиклинка. Велюровая джинса. Яркие цвета. Металлическая застежка. Плотный козырек со вставкой другого цвета. <b><br>Плотность: 200 гр/м2<br>Количество цветов: 18<br></b>" + "Покупайте <a href=\"http://www.modernimport.by/beysbolki\" class=\"underline_link\">бейсболки</a> в Минске у Модерн Импорт!<br>"
  	  	      	              	    product_type.save
  	  	      	                  else
  	  	      	                    if product_type.id == 18
  	  	      	              	      product_type.description = "Состав: хлопок 100%. Шестиклинка. Велюровая джинса. Яркие цвета. Металлическая застежка. Трехслойный комбинированный плотный козырек. Декоративные канты и вставка козырька другого цвета.<b><br>Плотность: 200 гр/м2<br>Количество цветов: 10<br></b>" + "Покупайте <a href=\"http://www.modernimport.by/beysbolki\" class=\"underline_link\">бейсболки</a> в Минске у Модерн Импорт!<br>"
  	  	      	              	      product_type.save
  	  	      	                    end
  	  	      	                  end
  	  	      	                end
  	  	      	              end
  	  	      	            end
  	  	      	          end
  	  	      	        end
  	  	      	      end
  	  	      	    end
  	  	      	  end
  	  	      	end
  	  	      end
  	  	    end
  	  	  end
  	  	end
  	  end
  	end
  end
end